[
  {
    "href": "https://ui-guideline-v2.vercel.app/",
    "title": "UI Guideline",
    "body": "Standardized  UI component nomenclature, aimed to make UI Guideline an essential resource for UI professionals. Key responsibilities included data optimization, responsive design, cross­ browser testing, SEO enhancements, and WCAG-compliant accessibility features.",
    "tags": ["Next.js 13", "Tailwind 3.3.0", "TypeScript 5.0.4", "Prisma 4.13.0", "tRPC 10.20.0", "React 18.2.0", "Clerk 4.27.1"],
    "date": "Aug 2023 - Present"
  },
  {
    "href": "",
    "title": "Freelancer · Front-End Developer",
    "body": "Specialize in mobile-first web development projects, championing responsive design principles to ensure optimal user experience across various devices. Engage with a spectrum of web development initiatives, with a keen focus on leveraging modern front-end technologies and innovative user interface design. Collaborate with industry professionals, contributing expertise to high-impact projects that deliver cutting-edge and user-centric solutions.",
    "tags": ["Freelancing", "Web Development", "UI/UX", "Responsive Design"],
    "date": "2021 - Present"
  },
  {
    "href": "",
    "title": "TEKRED · Security Equipment Installer",
    "body": "Commenced as a security camera installer, rapidly acquiring skills for comprehensive security system management. Enhanced procedural efficiency, optimizing the installation and maintenance of security apparatus.",
    "tags": ["Security Systems", "Programming", "Installation"],
    "date": "2016 - 2020"
  },
  {
    "href": "",
    "title": "PrintExpress · Junior Graphic Designer",
    "body": "Crafted marketing materials, including logos and flyers. Engaged with customers for design satisfaction. Managed the printing process for high-quality outputs.",
    "tags": ["Graphic Design", "Customer Service", "Printing"],
    "date": "2014 - 2015"
  },
  {
    "href": "",
    "title": "OmegaTech · Computer Repair Technician",
    "body": "Handled 10-12 computer repairs daily, later increasing to 25 per day. Improved repair protocols and analytical procedures, boosting productivity.",
    "tags": ["Computer Repair", "Technician", "Productivity"],
    "date": "2013 - 2014"
  }
]
